/**
Свёртка в диапазоны

Дан список переменных типа Number. Повторяющихся элементов в нём нет. 
Преобразуйте это множество в строку, сворачивая соседние по числовому ряду числа в диапазоны. 
Если был передан пустой массив, необходимо вывести в консоль строку "undefined".

---

- Подумайте, что нужно сделать с массивом, прежде чем формировать интервалы.
- Обработайте граничные значения, когда массив пустой или содержит один элемент.

*/

function compress(list) {
  // ваш код
}

export { compress };
export default compress;
